__add__() # добавить конкатенацию как в последовательность +
__len__() # добавить поддержку len()
__sub__() # добавить поддержку двухместного оператора -
__init__() # инициализация объекта
__repr__() # Настройка вывода репрезентативной формы
__eq__(self, other) # Как будет осуществлено x == y
__lt__(self, other) # Как будет осуществлено x < y
__le__(self, other) # Как будет осуществлено x <= y
__ne__(self, other) # Как будет осуществлено x != y
__ge__(self, other) # Как будет осуществлено x >= y
__gt__(self, other) # Как будет осуществлено x > y